uhnp/src/InformationRegisters/РегистрСостоянийОбъектов/РегистрСостоянийОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрСостоянийОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеОбъекта</name>
    <type>
      <types>EnumRef.СостоянияИнцидентов</types>
      <types>EnumRef.СостоянияСогласования</types>
      <types>EnumRef.СтатусыВыгружаемыхОбъектовЕИС</types>
      <types>EnumRef.СостоянияДоговоров</types>
      <types>EnumRef.СостоянияТранзакций</types>
      <types>EnumRef.СостоянияМероприятий</types>
      <types>EnumRef.СостоянияПроектов</types>
      <types>CatalogRef.СостоянияСогласования</types>
      <types>EnumRef.СостоянияОтчетов</types>
      <types>EnumRef.СтатусыЛотов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектыДляСогласования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/АктуальностьУстановленныхЛимитов/АктуальностьУстановленныхЛимитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктуальностьУстановленныхЛимитов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументыБюджетированияИУправлениеЛимитами</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Область</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УОП</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПараметрыЛимитирования/ПараметрыЛимитирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитирования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПериодовЛимитирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРезервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьАналитикиСтатьиБюджетаПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаПоУмолчанию</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПланированиеЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезервированиеВПериодичностиПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СостояниеУстановкиЛимитовОбъектами/СостояниеУстановкиЛимитовОбъектами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеУстановкиЛимитовОбъектами</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияУстановкиЛимитов</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Область</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УОП</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СостоянияУстановкиЛимитов/СостоянияУстановкиЛимитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияУстановкиЛимитов</name>
  <enumValues>
    <name>НеУстановлен</name>
  </enumValues>
  <enumValues>
    <name>Установлен</name>
  </enumValues>
  <enumValues>
    <name>УстановленПоНеутвержденнымДанным</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ОбъектыСогласованияЗначенийПоказателейОтчетов/ОбъектыСогласованияЗначенийПоказателейОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбъектыСогласованияЗначенийПоказателейОтчетов</name>
  <enumValues>
    <name>ЭкземплярОтчета</name>
  </enumValues>
  <enumValues>
    <name>Ракурс</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/НастраиваемыйОтчет/НастраиваемыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НастраиваемыйОтчет</name>
  <basedOn>Catalog.БланкиОтчетов</basedOn>
  <basedOn>Catalog.ВидыОтчетов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВывода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОтчета</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечанияБланков</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОтображения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыКонтекстногоОбновленияЗависимыхЯчеек</name>
    <type>
      <types>EnumRef.ПараметрыКонтекстногоОбновленияЗависимыхЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлИмпорта</name>
    <type>
      <types>CatalogRef.ХранимыеФайлыОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеПериодом</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончания</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияОтчета</name>
    <type>
      <types>EnumRef.СпособыФормированияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоПроверки</name>
    <type>
      <types>CatalogRef.ПравилаПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>БланкИмпорта</name>
    <type>
      <types>CatalogRef.БланкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСвертывания</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧтениеНеактуальныхЗаписей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВноситьИзменения</name>
    <comment>Не вносить изменения в отчет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Состояние</name>
    <type>
      <types>EnumRef.СостоянияОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОтчета</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеВалюты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭкземплярыИсточники</name>
    <attributes>
      <name>ЭкземплярОтчета</name>
      <type>
        <types>DocumentRef.НастраиваемыйОтчет</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/РакурсДанных/РакурсДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РакурсДанных</name>
  <registerRecords>AccumulationRegister.УдалитьЛимитыПоБюджетам</registerRecords>
  <attributes>
    <name>Область</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачалоДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончаниеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеЗаблокировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
</mdclass:Document>

uhnp/src/CommonModules/УстановкаЛимитовУХ/Module.bsl
#Область ПрограммныйИнтерфейс

// Вызывается и процедуры ПередЗаписью(..) набора записей регистра сведений РегистрСостоянийОбъектов 
Процедура РегистрСостоянийОбъектовПередЗаписью(НаборЗаписей) Экспорт
	
	Если НаборЗаписей.Отбор.Объект.Использование И ЗначениеЗаполнено(НаборЗаписей.Отбор.Объект.Значение)
		И (ТипЗнч(НаборЗаписей.Отбор.Объект.Значение) = Тип("ДокументСсылка.НастраиваемыйОтчет") 
			ИЛИ ТипЗнч(НаборЗаписей.Отбор.Объект.Значение) = Тип("ДокументСсылка.РакурсДанных"))
		И НаборЗаписей.Отбор.Период.Использование И ЗначениеЗаполнено(НаборЗаписей.Отбор.Период.Значение) Тогда
		
		НовыйПериод = НаборЗаписей.Отбор.Период.Значение;		
		Документ = НаборЗаписей.Отбор.Объект.Значение;
		
		Если НаборЗаписей.Количество() > 0 Тогда
			НовоеСостояние = НаборЗаписей[0].СостояниеОбъекта;
		Иначе
			НовоеСостояние = Перечисления.СостоянияОтчетов.ПустаяСсылка();
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Объект", Документ);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК СостояниеОбъекта,
		|	РегистрСостоянийОбъектовСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних(, Объект = &Объект) КАК РегистрСостоянийОбъектовСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекущееСостояние = Выборка.СостояниеОбъекта;
			ТекущийПериод = Выборка.Период;
		Иначе
			ТекущееСостояние = Перечисления.СостоянияОтчетов.ПустаяСсылка();
			ТекущийПериод = Дата(1, 1, 1);
		КонецЕсли;
		
		Если ТекущееСостояние <> НовоеСостояние И НовыйПериод > ТекущийПериод Тогда
			СнятьАктуальностьЛимитовПоДокументу(Документ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СнятьАктуальностьЛимитовПоДокументу(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастраиваемыйОтчет.Организация КАК Организация,
	|	НастраиваемыйОтчет.ВидОтчета КАК ВидОтчета,
	|	НастраиваемыйОтчет.УправлениеПериодом КАК УправлениеПериодом,
	|	ЗНАЧЕНИЕ(Справочник.ОбластиДанныхВидовОтчетов.ПустаяСсылка) КАК Область,
	|	НастраиваемыйОтчет.Проект КАК Проект
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	Документ.НастраиваемыйОтчет КАК НастраиваемыйОтчет
	|ГДЕ
	|	НастраиваемыйОтчет.Ссылка = &Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РакурсДанных.Организация,
	|	РакурсДанных.Область.Владелец,
	|	УправлениеПериодомСценария.Ссылка,
	|	РакурсДанных.Область,
	|	РакурсДанных.Проект
	|ИЗ
	|	Документ.РакурсДанных КАК РакурсДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УправлениеПериодомСценария КАК УправлениеПериодомСценария
	|		ПО РакурсДанных.Сценарий = УправлениеПериодомСценария.Сценарий
	|			И (НЕ УправлениеПериодомСценария.ПометкаУдаления)
	|			И РакурсДанных.Периодичность = УправлениеПериодомСценария.ТекущаяПериодичность
	|			И РакурсДанных.ПериодНачалоДата = УправлениеПериодомСценария.ПериодСценария.ДатаНачала
	|			И РакурсДанных.ПериодОкончаниеДата = УправлениеПериодомСценария.ПериодСценарияОкончание.ДатаОкончания
	|			И (УправлениеПериодомСценария.УстанавливатьЛимиты)
	|ГДЕ
	|	РакурсДанных.Ссылка = &Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаСинтетика.Организация,
	|	КорректировкаСинтетика.ВидОтчета,
	|	КорректировкаСинтетика.Ссылка.УправлениеПериодом,
	|	ЗНАЧЕНИЕ(Справочник.ОбластиДанныхВидовОтчетов.ПустаяСсылка),
	|	КорректировкаСинтетика.Проект
	|ИЗ
	|	Документ.КорректировкаЗначенийПоказателей.КорректировкаСинтетика КАК КорректировкаСинтетика
	|ГДЕ
	|	КорректировкаСинтетика.Ссылка = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктуальностьУстановленныхЛимитовСрезПоследних.Организация КАК Организация,
	|	АктуальностьУстановленныхЛимитовСрезПоследних.ВидОтчета КАК ВидОтчета,
	|	АктуальностьУстановленныхЛимитовСрезПоследних.Область КАК Область,
	|	АктуальностьУстановленныхЛимитовСрезПоследних.УОП КАК УОП,
	|	ЛОЖЬ КАК Актуальность,
	|	АктуальностьУстановленныхЛимитовСрезПоследних.Предназначение КАК Предназначение,
	|	АктуальностьУстановленныхЛимитовСрезПоследних.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.АктуальностьУстановленныхЛимитов.СрезПоследних(
	|			,
	|			(Организация, ВидОтчета, УОП, Область, Проект) В
	|				(ВЫБРАТЬ
	|					ВТ_Документ.Организация КАК Организация,
	|					ВТ_Документ.ВидОтчета КАК ВидОтчета,
	|					ВТ_Документ.УправлениеПериодом КАК УправлениеПериодом,
	|					ВТ_Документ.Область КАК Область,
	|					ВТ_Документ.Проект КАК Проект
	|				ИЗ
	|					ВТ_Документ КАК ВТ_Документ)) КАК АктуальностьУстановленныхЛимитовСрезПоследних
	|ГДЕ
	|	АктуальностьУстановленныхЛимитовСрезПоследних.Актуальность";
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.АктуальностьУстановленныхЛимитов.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДатаСеанса();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Документ = Документ;
		Запись.Пользователь = Пользователи.ТекущийПользователь();
		Запись.Записать();
	КонецЦикла;

КонецПроцедуры


// Процедура выполняет проверку документа УправлениеПериодомСценария  перед его записью.
Процедура ПроверкаУстановкиЛимитовПередЗаписьюУправлениеПериодомСценария(Объект, Отказ) Экспорт
	
	Если Объект.УстанавливатьЛимиты Тогда
		ПараметрыУОП = Новый Структура("ТекущаяПериодичность, ВерсияОрганизационнойСтруктуры, ВидыОтчетовДляУстановкиЛимитов, ПериодСценария, ПериодСценарияОкончание");
		ЗаполнитьЗначенияСвойств(ПараметрыУОП, Объект);
		ПараметрыУОП.ВидыОтчетовДляУстановкиЛимитов = Объект.ВидыОтчетовДляУстановкиЛимитов.Выгрузить();
		РезультатВозможнаУстановкаЛимитов = ВозможнаУстановкаЛимитовИзУОП(ПараметрыУОП);
		Если Не РезультатВозможнаУстановкаЛимитов.ВозможнаУстановка Тогда
			ОбщегоНазначенияУХ.СообщитьОбОшибке(Объект, Отказ, РезультатВозможнаУстановкаЛимитов.ТекстОшибки);
		КонецЕсли;
	Иначе
		Если УстановленыЛимитыПоУОП(Объект.Ссылка) Тогда
			ТекстСообщения = НСтр("ru = 'По некоторым экземплярам УОП лимиты уже установлены.
			|Необходимо отменить установку лимитов и после чего повторить попытку изменения необходимости установки лимитов УОП.'");
			ОбщегоНазначенияУХ.СообщитьОбОшибке(Объект, Отказ, ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет заполнение МассивНепроверяемыхРеквизитов именами неиспользуемых реквизитов
Процедура ОбработкаПроверкиЗаполненияВидаОтчета(Объект, МассивНепроверяемыхРеквизитов) Экспорт
	
	Если Объект.ЭтоГруппа ИЛИ НЕ Объект.МожетИспользоватьсяДляУстановкиЛимитов Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПараметрыУстановкиЛимитов");
		МассивНепроверяемыхРеквизитов.Добавить("ПараметрыУстановкиЛимитов.КолонкаОтчета");
		МассивНепроверяемыхРеквизитов.Добавить("ПараметрыУстановкиЛимитов.ВидБюджета");
	КонецЕсли;
	
КонецПроцедуры

// Заполняет структуру ИспользованиеБюджетов значениями функциональных опций использования бюджетов
Процедура ПолучитьИспользованиеБюджетов(ИспользованиеБюджетов) Экспорт
	
	ИспользованиеБюджетов.Вставить("БюджетДвиженияДенежныхСредствИспользуется", Истина);
	ИспользованиеБюджетов.Вставить("БюджетДоходовРасходовИспользуется",	Истина);
	ИспользованиеБюджетов.Вставить("БюджетЗакупокИспользуется", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВозможнаУстановкаЛимитовИзУОП(ПараметрыУОП) Экспорт
	
	// +проверка наличия видов отчетов по которым возможна установка лимитов
	// +проверка, что по этим отчетам включено лимитирование
	// проверка периодичности УОП и периодичности лимитирования
	// проверка заполненности функциональной валюты для организации
	// проверка что функциональная валюта организации есть в шаблоне заполнения отчетов
		
	Результат = Новый Структура("ВозможнаУстановка, ТекстОшибки", Истина, "");
	
	ПериодичностьСценария = ПараметрыУОП.ТекущаяПериодичность;
	Регламент = ПараметрыУОП.ВерсияОрганизационнойСтруктуры;
	ТабВидыОтчетов = ПараметрыУОП.ВидыОтчетовДляУстановкиЛимитов;
	
	МассивВидовОтчета = ТабВидыОтчетов.ВыгрузитьКолонку("ВидОтчета");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыОтчетов.Ссылка КАК ВидОтчета
	|ПОМЕСТИТЬ ВТ_ВидыОтчетов
	|ИЗ
	|	Справочник.ВидыОтчетов КАК ВидыОтчетов
	|ГДЕ
	|	ВидыОтчетов.Ссылка В(&ВидыОтчетов)
	|	И ВидыОтчетов.МожетИспользоватьсяДляУстановкиЛимитов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыОтчетовУстановкаЛимитов.Предназначение КАК Предназначение
	|ПОМЕСТИТЬ ВТ_ВидыБюджетов
	|ИЗ
	|	Справочник.ВидыОтчетов.ПараметрыУстановкиЛимитов КАК ВидыОтчетовУстановкаЛимитов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВидыОтчетов КАК ВТ_ВидыОтчетов
	|		ПО ВидыОтчетовУстановкаЛимитов.Ссылка = ВТ_ВидыОтчетов.ВидОтчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Предназначение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВидыБюджетов.Предназначение КАК Предназначение,
	|	ИСТИНА КАК ИспользоватьПланирование,
	|	ПараметрыПланирования.ПериодичностьПланирования КАК ПериодичностьПланирования
	|ИЗ
	|	ВТ_ВидыБюджетов КАК ВТ_ВидыБюджетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыЛимитирования.СрезПоследних(, ) КАК ПараметрыПланирования
	|		ПО ВТ_ВидыБюджетов.Предназначение = ПараметрыПланирования.ВидБюджета.Предназначение";
	Запрос.УстановитьПараметр("ВидыОтчетов", МассивВидовОтчета);
	Запрос.УстановитьПараметр("Регламент", Регламент);
	
	ВалютаУпрУчета = Константы.ВалютаУправленческогоУчета.Получить();
	Запрос.УстановитьПараметр("ВалютаУпрУчета", ВалютаУпрУчета);
	
	НачалоПериодаСценария = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыУОП.ПериодСценария, "ДатаНачала");
	Если Не ЗначениеЗаполнено(НачалоПериодаСценария) Тогда
		 Результат.ВозможнаУстановка = Ложь;
		 Результат.ТекстОшибки = НСтр("ru = 'В документе ""Управление отчетным периодом"" не задан период.'");
		 Возврат Результат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ГодЛимитирования", НачалоГода(НачалоПериодаСценария));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	
	ПараметрыВидовБюджетов = РезультатЗапроса[2].Выгрузить();
	
	// 1. проверка наличия бюджетов с лимитами в виде отчета
	Если ПараметрыВидовБюджетов.Количество() = 0 Тогда
		 Результат.ВозможнаУстановка = Ложь;
		 Результат.ТекстОшибки = НСтр("ru = 'Из регламента не удалось получить виды отчетов, по которым необходимо установить лимиты.
                                       |Виды отчета определяются либо в шаблоне процесса, либо в поле регламента ""Виды отчета регламента""'");
		 Возврат Результат;
	КонецЕсли;
		
	// 3. проверка периода УОП
	СтрОшибкаПериода = "";
	Для каждого СтрокаБюджета Из ПараметрыВидовБюджетов Цикл
		Если СтрокаБюджета.ИспользоватьПланирование Тогда
			РезультатСравнения = СравнитьПериодичность(ПериодичностьСценария, СтрокаБюджета.ПериодичностьПланирования);
			Если РезультатСравнения > 0 Тогда
				 СтрОшибкаПериода =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Периодичность УОП: ""%1"" крупнее периодичности планирования в настройках: ""%2""'"), 
				 	ПериодичностьСценария, СтрокаБюджета.ПериодичностьПланирования);
				Прервать;	
			КонецЕсли;
		КонецЕсли;			
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрОшибкаПериода) Тогда
		Результат.ВозможнаУстановка = Ложь;
		Результат.ТекстОшибки = СтрОшибкаПериода;
		Возврат Результат;
	КонецЕсли;
	
	// Проверка настроек вида отчета при записи УОП: По указанной колонке лимитирования отсутствуют строки/показатели,
	// связанные со статьями лимитируемого бюджета
	РезультатПроверки = ПроверитьНаличиеПоказателейУстанавливающихЛимиты(МассивВидовОтчета);
	Если НЕ РезультатПроверки.Успешно Тогда
		Результат.ВозможнаУстановка = Ложь;
		Результат.ТекстОшибки = РезультатПроверки.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УстановленыЛимитыПоУОП(УОП) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УОП", УОП);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостояниеУстановкиЛимитовОбъектамиСрезПоследних.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.СостояниеУстановкиЛимитовОбъектами.СрезПоследних(, УОП = &УОП) КАК СостояниеУстановкиЛимитовОбъектамиСрезПоследних
	|ГДЕ
	|	СостояниеУстановкиЛимитовОбъектамиСрезПоследних.Состояние В(ЗНАЧЕНИЕ(Перечисление.СостоянияУстановкиЛимитов.Установлен), ЗНАЧЕНИЕ(Перечисление.СостоянияУстановкиЛимитов.УстановленПоНеутвержденнымДанным))";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция УстанавливаемыеВидыБюджетов(УОП) Экспорт
	
	РеквизитыУОП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УОП, "ТекущаяПериодичность, ВерсияОрганизационнойСтруктуры, Сценарий, ПериодСценария.ДатаНачала, ПериодСценарияОкончание.ДатаОкончания");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сценарий", РеквизитыУОП.Сценарий);
	Запрос.УстановитьПараметр("ДатаНачала", РеквизитыУОП.ПериодСценарияДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", РеквизитыУОП.ПериодСценарияОкончаниеДатаОкончания);
	Запрос.УстановитьПараметр("Периодичность", РеквизитыУОП.ТекущаяПериодичность);
	Запрос.УстановитьПараметр("УправлениеПериодом", УОП);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыОтчетовУстановкаЛимитов.Предназначение КАК Предназначение
	|ИЗ
	|	Документ.РакурсДанных КАК РакурсДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыОтчетов.ПараметрыУстановкиЛимитов КАК ВидыОтчетовУстановкаЛимитов
	|		ПО РакурсДанных.Область.Владелец = ВидыОтчетовУстановкаЛимитов.Ссылка
	|			И (ВидыОтчетовУстановкаЛимитов.Ссылка.ОбъектДляСогласованияЗначений = ЗНАЧЕНИЕ(Перечисление.ОбъектыСогласованияЗначенийПоказателейОтчетов.Ракурс))
	|ГДЕ
	|	НЕ РакурсДанных.ПометкаУдаления
	|	И РакурсДанных.Сценарий = &Сценарий
	|	И РакурсДанных.ПериодНачалоДата >= &ДатаНачала
	|	И РакурсДанных.ПериодОкончаниеДата <= &ДатаОкончания
	|	И РакурсДанных.Периодичность = &Периодичность
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВидыОтчетовУстановкаЛимитов.Предназначение
	|ИЗ
	|	Документ.НастраиваемыйОтчет КАК НастраиваемыйОтчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыОтчетов.ПараметрыУстановкиЛимитов КАК ВидыОтчетовУстановкаЛимитов
	|		ПО НастраиваемыйОтчет.ВидОтчета = ВидыОтчетовУстановкаЛимитов.Ссылка
	|			И (ВидыОтчетовУстановкаЛимитов.Ссылка.ОбъектДляСогласованияЗначений = ЗНАЧЕНИЕ(Перечисление.ОбъектыСогласованияЗначенийПоказателейОтчетов.ЭкземплярОтчета))
	|ГДЕ
	|	НЕ НастраиваемыйОтчет.ПометкаУдаления
	|	И НастраиваемыйОтчет.УправлениеПериодом = &УправлениеПериодом";
	
	МассивВидовБюджета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Предназначение");
	
	Возврат МассивВидовБюджета;
	
КонецФункции

Функция ПараметрыОткрытияДокументаЛимита(ДанныеЯчейки) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ДанныеЯчейки.УстановкаЛимита);
	
	РасшифровкаПоказателей = Новый Структура;
	РасшифровкаПоказателей.Вставить("Показатель", ДанныеЯчейки.Показатель);
	РасшифровкаПоказателей.Вставить("ПериодОтчета", ДанныеЯчейки.ПериодОтчета);
	РасшифровкаПоказателей.Вставить("Валюта", ДанныеЯчейки.Валюта);
	Для ном = 1 По ОперативноеПланированиеКонтроль.ПараметрСеанса_ЧислоДопАналитик() Цикл
		ЗначениеАналитики = ДанныеЯчейки["АналитикаПоказателя" + ном];
		Если ЗначениеАналитики <> Неопределено Тогда
			РасшифровкаПоказателей.Вставить("Аналитика" + ном, ЗначениеАналитики);
		КонецЕсли;	
	КонецЦикла;
	
	ПараметрыОткрытия.Вставить("РасшифровкаПоказателей", РасшифровкаПоказателей);
	
	Возврат ПараметрыОткрытия;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СравнитьПериодичность(Периодичность1, Периодичность2)
	
	Индекс1 = Перечисления.Периодичность.Индекс(Периодичность1);
	Индекс2 = Перечисления.Периодичность.Индекс(Периодичность2);
	
	Если Индекс1 > Индекс2 Тогда
		РезультатСравнения = 1;
	ИначеЕсли Индекс1 < Индекс2	Тогда
		РезультатСравнения = -1;
	Иначе
		РезультатСравнения = 0;
	КонецЕсли;
	
	Возврат РезультатСравнения;
	
КонецФункции

Функция ПроверитьНаличиеПоказателейУстанавливающихЛимиты(МассивВидовОтчета)
	
	Результат = Новый Структура("Успешно, ТекстОшибки", Истина, ""); 
	 
	Запрос = Новый Запрос( 
	"ВЫБРАТЬ
	|	ВидыОтчетов.Ссылка КАК ВидОтчета
	|ПОМЕСТИТЬ ВТ_ВидыОтчетов
	|ИЗ
	|	Справочник.ВидыОтчетов КАК ВидыОтчетов
	|ГДЕ
	|	ВидыОтчетов.Ссылка В(&ВидыОтчетов)
	|	И ВидыОтчетов.МожетИспользоватьсяДляУстановкиЛимитов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВидыОтчетов.ВидОтчета КАК ВидОтчета,
	|	ВидыОтчетовУстановкаЛимитов.Предназначение КАК Предназначение,
	|	ВидыОтчетовУстановкаЛимитов.КолонкаОтчета КАК КолонкаОтчета
	|ПОМЕСТИТЬ ВТ_ВидыБюджетов
	|ИЗ
	|	Справочник.ВидыОтчетов.ПараметрыУстановкиЛимитов КАК ВидыОтчетовУстановкаЛимитов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВидыОтчетов КАК ВТ_ВидыОтчетов
	|		ПО ВидыОтчетовУстановкаЛимитов.Ссылка = ВТ_ВидыОтчетов.ВидОтчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВидыБюджетов.ВидОтчета КАК ВидОтчета,
	|	ВТ_ВидыБюджетов.Предназначение КАК Предназначение,
	|	ПоказателиОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ВидыБюджетов КАК ВТ_ВидыБюджетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|		ПО ВТ_ВидыБюджетов.ВидОтчета = ПоказателиОтчетов.Владелец
	|			И ВТ_ВидыБюджетов.КолонкаОтчета = ПоказателиОтчетов.Колонка
	|			И ВТ_ВидыБюджетов.Предназначение = ПоказателиОтчетов.Предназначение
	|ГДЕ
	|	ПоказателиОтчетов.Ссылка ЕСТЬ NULL"
	);
	
	Запрос.УстановитьПараметр("ВидыОтчетов", МассивВидовОтчета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивОшибок = Новый Массив;
	Пока Выборка.Следующий() Цикл
		
		Текст =  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Для вида отчета: %1 не найдены показатели для установки бюджета: %2'"), Выборка.ВидОтчета, Выборка.Предназначение);
		МассивОшибок.Добавить(Текст);
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивОшибок) Тогда
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = СтрСоединить(МассивОшибок, Символы.ПС);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
